#### DisplayStyle Enumeration

---

|  |
| --- |
| See Also |

Display type of the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum DisplayStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DisplayStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class DisplayStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | View does not use Render Type |
| Wireframe | Wireframe |
| HLR | Hidden Line Removal |
| Shading | Shading |
| ShadingWithEdges | Shading With Edges |
| Rendering | Rendering |
| Realistic | Realistic |
| FlatColors | Flat Colors |
| RealisticWithEdges | Realistic With Edges |

# See Also

Autodesk.Revit.DB Namespace